fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Создаем команду формы
	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	
	// 2. Добавляем кнопку на командную панель таблицы
	// Проверьте имя элемента командной панели в вашей форме (обычно НачисленияЗПКоманднаяПанель)
	ЭлементПанель = Элементы.ВыплатыКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
				   |	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
				   |ИЗ
				   |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
				   |СГРУППИРОВАТЬ ПО
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";

	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить().Выбрать();

	Объект.Выплаты.Очистить();

	Пока Результат.Следующий() Цикл

		Строка = Объект.Выплаты.Добавить();
		Строка.Сотрудник = Результат.Сотрудник;
		Строка.Сумма = Результат.СуммаОстаток;

	КонецЦикла;


КонецПроцедуры
#КонецОбласти
